---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GridFailures
source: html/48cf99c8-ce67-2506-5914-592a04f61c47.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridFailures

Failures about Grid.

## Syntax (C#)
```csharp
public static class GridFailures
```